export const firstText = `
  Еней був парубок моторний
  І хлопець хоть куди козак,
  Удавсь на всеє зле проворний,
  Завзятійший од всіх бурлак.
  Но греки, як спаливши Трою,
  Зробили з неї скирту гною,
  Він взявши торбу тягу дав;
  Забравши деяких троянців,
  Осмалених, як гиря, ланців,
  П'ятами з Трої накивав.

  Він, швидко поробивши човни,
  На синє море поспускав,
  Троянців насаджавши повні,
  І куди очі почухрав.
  Но зла Юнона, суча дочка,
  Розкудкудакалась, як квочка,
  Енея не любила - страх;
  Давно вона уже хотіла,
  Щоб його душка полетіла
  К чортам і щоб і дух не пах.

  Еней був тяжко не по серцю
  Юноні, - все її гнівив:
  Здававсь гірчийший їй від перцю,
  Ні в чим Юнони не просив;
  Но гірш за те їй не любився,
  Що, бачиш, в Трої народився
  І мамою Венеру звав;
  І що його покійний дядько,
  Паріс, Пріамове дитятко,
  Путівочку Венері дав.

  Побачила Юнона з неба,
  Що пан Еней на поромах;
  А то шепнула сука Геба...
  Юнону взяв великий жах!
  Впрягла в гринджолята павичку,
  Сховала під кибалку мичку,
  Щоб не світилася коса;
  Взяла спідницю і шнурівку,
  І хліба з сіллю на тарілку,
  К Еолу мчалась, як оса.

  "Здоров, Еоле, пане-свату!
  Ой, як ся маєш, як живеш? -
  Сказала, як ввійшла у хату,
  Юнона. - Чи гостей ти ждеш?.."
  Поставила тарілку з хлібом
  Перед старим Еолом-дідом,
  Сама же сіла на ослін.
  "Будь ласкав, сватоньку-старику!
  Ізбий Енея з пантелику,
  Тепер пливе на море він.

  Ти знаєш, він який суціга,
  Паливода і горлоріз;
  По світу як іще побіга,
  Чиїхсь багацько виллє сліз.
  Пошли на його лихо злеє,
  Щоб люди всі, що при Енеї,
  Послизли і щоб він і сам...
  За сеє ж дівку чорнобриву,
  Смачную, гарну, уродливу,
  Тобі я, далебі, що дам".

  "Гай, гай! Ой, дей же його кату!-
  Еол насупившись сказав. -
  Я все б зробив за сюю плату,
  Та вітри всі порозпускав:
  Борей недуж лежить з похмілля,
  А Нот поїхав на весілля,
  Зефір же, давній негодяй,
  З дівчатами заженихався,
  А Евр в поденщики найнявся, -
  Як хочеш, так і помишляй!

  Та вже для тебе обіщаюсь
  Енеєві я ляпас дать;
  Я хутко, миттю постараюсь
  В трістя його к чортам загнать.
  Прощай же! Швидше убирайся,
  Обіцянки не забувайся,
  Бо послі, чуєш, нічичирк!
  Як збрешеш, то хоча надсядься,
  На ласку послі не понадься,
  Тогді від мене возьмеш чвирк".

  Еол, оставшись на господі,
  Зобрав всіх вітрів до двора,
  Велів поганій буть погоді...
  Якраз на морі і гора!
  Все море зараз спузирило,
  Водою мов в ключи забило,
  Еней тут крикнув, як на пуп;
  Заплакався і заридався,
  Пошарпався, увесь подрався,
  На тім'ї начесав аж струп.

  Прокляті вітри роздулися,
  А море з лиха аж реве;
  Слізьми троянці облилися,
  Енея за живіт бере;
  Всі човники їх розчухрало,
  Багацько війська тут пропало;
  Тогді набрались всі сто лих!
  Еней кричіть, що "я Нептуну
  Півкопи грошей в руку суну,
  Аби на морі штурм утих".

  Нептун іздавна був дряпічка,
  Почув Енеїв голосок;
  Шатнувся зараз із запічка,
  Півкопи для його кусок!..
  І миттю осідлавши рака,
  Схвативсь на його, мов бурлака,
  І вирнув з моря як карась.
  Загомонів на вітрів грізно:
  "Чого ви гудете так грізно?
  До моря, знаєте, вам зась!"

  От тут-то вітри схаменулись
  І ну всі драла до нори;
  До ляса, мов ляхи, шатнулись,
  Або од їжака тхори.
  Нептун же зараз взяв мітелку
  І вимів море як світелку,
  То сонце глянуло на світ.
  Еней тогді як народився,
  Разів із п'ять перехрестився,
  Звелів готовити обід.

  Поклали шальовки соснові,
  Кругом наставили мисок;
  І страву всякую, без мови,
  В голодний пхали все куток.
  Тут з салом галушки лигали,
  Лемішку і куліш глитали
  І брагу кухликом тягли;
  Та і горілочку хлистали, --
  Насилу із-за столу встали
  І спати послі всі лягли.

  Венера, не послідня шльоха,
  Проворна, враг її не взяв,
  Побачила, що так полоха
  Еол синка, що аж захляв;
  Умилася, причепурилась
  І, як в неділю, нарядилась,
  Хоть би до дудки на танець!
  Взяла очіпок грезетовий
  І кунтуш з усами люстровий,
  Пішла к Зевесу на ралець.

  Зевес тогді кружав сивуху
  І оселедцем заїдав;
  Він, сьому випивши восьмуху,
  Послідки з кварти виливав.
  Прийшла Венера, іскривившись.
  Заплакалась и завіскрившись,
  І стала хлипать перед ним:
  "Чим пред тобою, милий тату,
  Син заслужив таку мій плату?
  Ійон, мов в свинки грають їм.

  Куди йому уже до Риму?
  Хіба як здохне чорт в рові!
  Як вернеться пан хан до Криму,
  Як женитсья сич на сові.
  Хіба б уже та не Юнона,
  Щоб не вказала макогона,
  Що й досі слухає чмелів!
  Коли б вона та не бісилась,
  Замовкла і не комизилась,
  Щоб ти се сам їй ізвелів".

  Юпітер, все допивши з кубка,
  Погладив свій рукою чуб:
  "Ох, доцю, ти моя голубка!
  Я в правді твердий так, як дуб.
  Еней збудує сильне царство
  І заведе своє там панство:
  Не малий буде він панок.
  На панщину ввесь світ погонить,
  Багацько хлопців там наплодить
  І всім їм буде ватажок.

  Заїде до Дідони в гості
  І буде там бенкетовать;
  Полюбиться її він мосці
  І буде бісики пускать.
  Іди, небого, не журися,
  Попонеділкуй, помолися,
  Все буде так, як я сказав".
  Венера низько поклонилась
  І з панотцем своїм простилась,
  А він її поціловав.

  Еней прочумався, проспався
  І голодранців позбирав,
  Зовсім зібрався і уклався,
  І, скілько видно, почухрав.
  Плив-плив, плив-плив, що аж обридло,
  І море так йому огидло,
  Що бісом на його дививсь:
  "Коли б, -- каже, -- умер я в Трої,
  Уже б не пив сеї гіркої
  І марне так не волочивсь".

  Потім, до берега приставши
  З троянством голим всім своїм,
  На землю з човнів повстававши,
  Спитавсь, чи є що їсти їм.
  І зараз чогось попоїли,
  Щоб на путі не ослабіли;
  Пішли, куди хто запопав.
  Еней по берегу попхався
  І сам не знав, куди слонявся,
  Аж гульк -- і в город причвалав.

  В тім городі жила Дідона,
  А город звався Карфаген,
  Розумна пані і моторна,
  Для неї трохи сих імен:
  Трудяща, дуже працьовита,
  Весела, гарна, сановита,
  Бідняжка -- що була вдова;
  По городу тогді гуляла,
  Коли троянців повстрічала,
  Такі сказала їм слова:

  "Відкіль такі се гольтіпаки?
  Чи рибу з Дону везете?
  Чи, може, виходці-бурлаки?
  Куди, прочане, ви йдете?
  Який вас враг сюди направив?
  І хто до города причалив?
  Яка ж ватага розбишак!"
  Троянці всі замурмотали,
  Дідоні низько в ноги пали,
  А, вставши, їй мовляли так:

  "Ми всі, як бач, народ хрещений,
  Волочимся без талану,
  Ми в Трої, знаєш, порождені,
  Еней пустив на нас ману;
  Дали нам греки прочухана
  І самого Енея-пана
  В три вирви вигнали відтіль;
  Звелів покинути нам Трою,
  Підмовив плавати з собою,
  Тепер ти знаєш ми відкіль,

  Помилуй, пані благородна!
  Не дай загинуть головам,
  Будь милостива, будь незлобна,
  Еней спасибі скаже сам.
  Чи бачиш, як ми обідрались!
  Убрання, постоли порвались,
  Охляли, ніби в дощ щеня!
  Кожухи, свити погубили
  І з голоду в кулак трубили,
  Така нам лучилась пеня".

  Дідона гірко заридала
  І з білого свого лиця
  Платочком сльози обтирала:
  "Коли б, -- сказала, -- молодця
  Енея вашого злапала,
  Уже б тогді весела стала,
  Тогді великдень був би нам!"
  Тут плюсь -- Еней як будто з неба:
  "Ось, ось де я, коли вам треба!
  Дідоні поклонюся сам".

  Потім, з Дідоною обнявшись,
  Поцілувались гарно в смак;
  За рученьки біленькі взявшись,
  Балакали то сяк, то так.
  Пішли к Дідоні до господи
  Через великі переходи,
  Ввійшли в світлицю та й на піл,
  Пили на радощах сивуху
  І їли сім'яну макуху,
  Покіль кликнули їх за стіл.

  Тут їли рознії потрави,
  І все з полив'яних мисок,
  І самі гарнії приправи
  З нових кленових тарілок:
  Свинячу голову до хріну
  І локшину на переміну,
  Потім з підлевою індик;
  На закуску куліш і кашу,
  Лемішку, зубци, путрю, квашу
  І з маком медовий шулик.

  І кубками пили слив'янку,
  Мед, пиво, брагу, сирівець,
  Горілку просту і калганку,
  Куривсь для духу яловець.
  Бандура горлиці бриньчала,
  Сопілка зуба затинала,
  А дудка грала по балках;
  Санжарівки на скрипці грали,
  Кругом дівчата танцьовали
  В дробушках, в чоботах, в світках.

  Сестру Дідона мала Ганну,
  Насправжки дівку хоть куди,
  Проворну, чепурну і гарну;
  Приходила і ся сюди
  В червоній юпочці баєвій,
  В запасці гарній фаналевій,
  В стьонжках, в намисті і в ковтках;
  Тут танцьовала викрутасом
  І пред Енеєм вихилясом
  Під дудку била третяка.

  Еней і сам так розходився,
  Як на аркані жеребець,
  Що трохи не увередився,
  Пішовши з Гандзею в танець.
  В обох підківки забряжчали,
  Жижки од танців задрижали,
  Вистрибовавши гоцака.
  Еней, матню в кулак прибравши
  І не до соли примовлявши,
  Садив крутенько гайдука.

  А послі танців варенухи
  По філіжанці піднесли,
  І молодиці-цокотухи
  Тут баляндраси понесли;
  Дідона кріпко заюрила,
  Горщок з вареною розбила,
  До дуру всі тогді пили.
  Ввесь день весело прогуляли
  І п'яні спати полягали;
  Енея ж ледве повели.

  Еней на ніч забрався спати,
  Зарився в просо, там і ліг;
  А хто хотів, побрів до хати,
  А хто в хлівець, а хто під стіг.
  А деякі так так хлиснули,
  Що де упали -- там заснули,
  Сопли, харчали і хропли;
  А добрі молодци кружали,
  Поки аж півні заспівали,--
  Що здужали, то все тягли.

  Дідона рано ісхопилась,
  Пила з похмілля сирівець;
  А послі гарно нарядилась,
  Як би в оренду на танець.
  Взяла караблік бархатовий,
  Спідницю і карсет шовковий
  І начепила ланцюжок;
  Червоні чоботи обула,
  Та і запаски не забула,
  А в руки з вибійки платок.

  Еней же, з хмелю як проспався,
  Із'їв солоний огірок;
  Потім умився і убрався,
  Як парубійка до дівок.
  Йому Дідона підослала,
  Що од покійника украла:
  Штани і пару чобіток,
  Сорочку і каптан з китайки,
  І шапку, пояс з каламайки,
  І чорний шовковий платок.

  Як одяглись, то ізійшлися,
  З собою стали розмовлять;
  Наїлися і принялися,
  Щоб по-вчорашньому гулять.
  Дідона ж тяжко сподобала
  Енея так, що і не знала,
  Де дітися і що робить;
  Точила всякії баляси
  І підпускала разні ляси,
  Енею тілько б угодить.

  Дідона виглядала грище,
  Еней щоб веселіший був,
  І щоб вертівся з нею ближче,
  І лиха щоб свого забув:
  Собі очиці зав'язала
  І у панаса грати стала,
  Енея б тілько уловить;
  Еней же зараз догадався,
  Коли Дідони терся, м'явся,
  Її щоб тілько вдовольнить.

  Тут всяку всячину іграли,
  Хто як і в віщо захотів;
  Тут інші журавля скакали,
  А хто од дудочки потів,
  І в хрещика, і в горюдуба,
  Не раз доходило до чуба,
  Як загулялися в джгута;
  В хлюста, в пари, в візка іграли
  І дамки по столу совали;
  Чорт мав порожнього кута.

  Щодень було у них похмілля,
  Пилась горілка, як вода;
  Щодень бенкети, мов весілля,
  Всі п'яні, хоть посуньсь куда.
  Енеєві так, як болячці
  Або лихій осінній трясці,
  Годила пані всякий день.
  Були троянці п'яні, ситі,
  Кругом обуті і обшиті,
  Хоть голі прибрели, як пень.

  Троянці добре там курили,
  Дали приманку всім жінкам,
  По вечерницям всі ходили,
  Просвітку не було дівкам.
  Та й сам Еней-сподар і паню
  Підмовив паритися в баню...
  Уже ж було не без гріха!
  Бо страх вона його любила,
  Аж розум ввесь свій погубила,
  А, бачся, не була плоха.

  От так Еней жив у Дідони,
  Забув і в Рим щоб мандровать.
  Тут не боявся і Юнони,
  Пустився все бенкетовать;
  Дідону мав він мов за жінку,
  Убивши добру в неї грінку,
  Мутив як на селі москаль!
  Бо -- хрін його не взяв -- моторний,
  Ласкавий, гарний, і проворний,
  І гострий, як на бритві сталь.

  Еней з Дідоною возились,
  Як з оселедцем сірий кіт;
  Ганяли, бігали, казились,
  Аж лився деколи і піт.
  Дідона ж мала раз роботу,
  Як з ним побігла на охоту,
  Та грім загнав їх в темний льох...
  Лихий їх зна, що там робили,
  Було не видно з-за могили,
  В льоху ж сиділи тілько вдвох.

  Не так-то робиться все хутко,
  Як швидко оком ізмигнеш;
  Або як казку кажеш прудко,
  Пером в папері як писнеш.
  Еней в гостях прожив немало,--
  Що з голови його пропало,
  Куди його Зевес послав.
  Він годів зо два там просидів,
  А мабуть би, і більш пронидів,
  Якби його враг не спіткав.

  Колись Юпітер ненароком
  З Олімпа глянув і на нас
  І кинув в Карфагену оком --
  Аж там троянський мартопляс...
  Розсердився і розкричався,
  Аж цілий світ поколихався;
  Енея лаяв на ввесь рот:
  "Чи так-то, гадів син, він слуха?
  Убрався в патоку, мов муха,
  Засів, буцім в болоті чорт.

  Пійдіть гінця мені кликніте,
  До мене зараз щоб прийшов,
  Глядіть же, цупку прикуріте,
  Щоб він в шинок та не зайшов!
  Бо хочу я кудись послати.
  Ійон, ійон же, вража мати!
  Але Еней наш зледащів;
  А то Венера все свашкує,
  Енеєчка свого муштрує,
  Щоб він з ума Дідону звів".

  Прибіг Меркурій, засапавшись,
  В три ряди піт з його котив;
  Ввесь ременцями обв'язавшись,
  На голову бриль наложив;
  На грудях з бляхою ладунка,
  А ззаду з сухарями сумка,
  В руках нагайський малахай.
  В такім наряді влізши в хату,
  Сказав: "Готов уже я, тату,
  Куди ти хочеш, посилай".

  "Біжи лиш швидше в Карфагену,--
  Зевес гінцеві так сказав,--
  І пару розлучи скажену,
  Еней Дідону б забував.
  Нехай лиш відтіль уплітає
  І Рима строїти чухрає,--
  А то залиг, мов в грубі пес.
  Коли ж він буде ще гуляти,
  То дам йому себе я знати,--
  От так сказав, скажи, Зевес".

  Меркурій низько поклонився,
  Перед Зевесом бриль ізняв,
  Через поріг перевалився,
  До стайні швидше тягу дав.
  Покинувши із рук нагайку,
  Запряг він миттю чортопхайку.
  Черкнув із неба, аж куріть.
  І все кобилок поганяє,
  Що оглобелька аж брикає,
  Помчали, аж візок скрипить.

  Еней тоді купався в бразі
  І на полу, укрившись, ліг;
  Йому не снилось о приказі,
  Як ось Меркурій в хату вбіг.
  Смикнув із полу, мов псяюху.
  "А що ти робиш, п'єш сивуху?--
  Зо всього горла закричав.--
  Ану лиш швидше убирайся,
  З Дідоною не женихайся,
  Зевес поход тобі сказав.

  Чи се ж таки для діла робиш,
  Що й досі тута загулявсь?
  Та швидко і не так задробиш;
  Зевес недурно похвалявсь;
  Получиш добру халазію,
  Він видавить з тебе олію,
  От тілько йще тут побарись.
  Гляди ж, сьогодні щоб убрався,
  Щоб нищечком відсіль укрався,
  Мене удруге не дождись".

  Еней піджав хвіст мов собака,
  Мов Каїн затрусивсь увесь;
  Із носа потекла кабака:
  Уже він знав, який Зевес.
  Шатнувся миттю сам із хати
  Своїх троянців позбирати;
  Зібравши, дав такий приказ:
  "Як можна швидше укладайтесь,
  Зо всіма клунками збирайтесь,
  До моря швендайте якраз!"

  А сам, вернувшися в будинки,
  Своє лахміття позбирав;
  Мізерії наклав дві скриньки,
  На човен зараз одіслав
  І дожидався тілько ночи,
  Що як Дідона зімкне очі,
  Щоб, не прощавшись, тягу дать.
  Хоть він за нею і журився
  І світом цілий день нудився,
  Та ба! бач, треба покидать.

  Дідона зараз одгадала,
  Чого сумує пан Еней,
  І все на ус собі мотала,
  Щоб умудритися і їй;
  З-за печі часто виглядала,
  Прикинувшись, буцім куняла
  І мов вона хотіла спать.
  Еней же думав, що вже спала,
  І тілько що хотів дать драла,
  Аж ось Дідона за чуб хвать.

  "Постій, прескурвий, вражий сину!
  Зо мною перше розплатись;
  От задушу, як злу личину!
  Ось ну лиш тілько завертись!
  От так за хліб, за сіль ти платиш?
  Ти всім, привикши насміхатись,
  Розпустиш славу по мені!
  Нагріла в пазусі гадюку,
  Що послі ізробила муку;
  Послала пуховик свині.

  Згадай, який прийшов до мене,
  Що ні сорочки не було;
  І постолів чорт мав у тебе,
  В кишені ж пусто, аж гуло;
  Чи знав ти, що такеє гроші?
  Мав без матні одні холоші,
  І тільки слава, що в штанах;
  Та й те порвалось і побилось,
  Аж глянуть сором, так світилось,
  Свитина вся була в латках.

  Чи я тобі та не годила?
  Хіба ріжна ти захотів?
  Десь вража мати підкусила,
  Щоб хирний тут ти не сидів.--
  Дідона гірко заридала,
  І з серця аж волосся рвала,
  І закраснілася, мов рак.
  Запінилась, посатаніла,
  Неначе дурману із'їла,
  Залаяла Енея так:--

  Поганий, мерзький, скверний, бридкий,
  Нікчемний, ланець, кателик!
  Гульвіса, пакосний, престидкий,
  Негідний, злодій, єретик!
  За кучму сю твою велику
  Як дам ляща тобі я в пику,
  То тут тебе лизне і чорт!
  І очі видеру із лоба
  Тобі, диявольська худоба.
  Трясешся, мов зимою хорт!

  Мандруй до сатани з рогами,
  Нехай тобі присниться біс!
  З своїми сучими синами,
  Щоб враг побрав вас всіх, гульвіс,
  Щоб ні горіли, ні боліли,
  На чистому щоб поколіли,
  Щоб не оставсь ні чоловік,
  Щоб доброї не знали долі,
  Були щоб з вами злії болі,
  Щоб ви шаталися повік!"

  Еней від неї одступався,
  Поки зайшов через поріг,
  А далі аж не оглядався,
  З двора в собачу ристь побіг.
  Прибіг к троянцям, засапався,
  Обмок в поту, як би купався,
  Мов з торгу в школу курохват;
  Потім, в човен хутенько сівши
  І їхати своїм велівши,
  Не оглядався сам назад.

  Дідона тяжко зажурилась,
  Ввесь день ні їла, ні пила;
  Все тосковала, все нудилась,
  Кричала, плакала, ревла.
  То бігала, як би шалена,
  Стояла довго тороплена,
  Кусала ногті на руках;
  А далі сіла на порозі,
  Аж зануділо їй, небозі,
  І не встояла на ногах.

  Сестру кликнула на пораду,
  Щоб горе злеє розказать,
  Енеєву оплакать зраду
  І льготи серцю трохи дать.
  "Ганнусю, рибко, душко, любко,
  Рятуй мене, моя голубко,
  Тепер пропала я навік!
  Енеєм кинута я, бідна,
  Як сама паплюга послідня,
  Еней злий змій -- не чоловік!

  Нема у серця мого сили,
  Щоб я змогла його забуть.
  Куди мні бігти? -- до могили!
  Туди один надежний путь!
  Я все для його потеряла,
  Людей і славу занедбала;
  Боги! я з ним забула вас.
  Ох! дайте зілля мні напитись,
  Щоб серцю можна розлюбитись,
  Утихомиритись на час.

  Нема на світі мні покою,
  Не ллються сльози із очей,
  Для мене білий світ єсть тьмою,
  Там ясно тілько, де Еней.
  О пуцьверинку Купідоне!
  Любуйся, як Дідона стогне...
  Щоб ти маленьким був пропав!
  Познайте, молодиці гожі,
  З Енеєм бахурі всі схожі,
  Щоб враг зрадливих всіх побрав!"

  Так бідна з горя говорила
  Дідона, жизнь свою кляла;
  І Ганна, що їй ні робила,
  Ніякой ради не дала.
  Сама з царицей горювала,
  І сльози рукавом втирала,
  І хлипала собі в кулак.
  Потім Дідона мов унишкла,
  Звеліла, щоб і Гандзя вийшла,
  Щоб їй насумуватись всмак.

  Довгенько так посумувавши,
  Пішла в будинки на постіль;
  Подумавши там, погадавши,
  Проворно скочила на піл.
  І, взявши з запічка кресало
  І клоччя в пазуху чимало,
  Тихенько вийшла на город.
  Ночною се було добою
  І самой тихою порою.
  Як спав хрещений ввесь народ.

  Стояв у неї на городі
  В кострі на зиму очерет;
  Хоть се не по царській породі,
  Та де ж взять дров, коли все степ;
  В кострі був зложений сухенький,
  Як порох був уже палкенький,
  Його й держали на підпал.
  Під ним вона огонь кресала,
  І в клоччі гарно розмахала,
  І розвела пожар чимал.

  Кругом костер той запаливши,
  Зо всей одежі роздяглась,
  В огонь лахміття все зложивши,
  Сама в огні тім простяглась.
  Вкруг неї полум'я палало,
  Покійниці не видно стало,
  Пішов од неї дим і чад!
  Енея так вона любила,
  Що аж сама себе спалила,
  Послала душу к чорту в ад.
`

export const secondText = `
  Генна інженерія ґрунтується на молекулярній біології, яка дає можливість вносити зміни в молекулярну взаємодію основних біологічних молекул у клітині й поза нею.
  Біологи оволоділи методами, які дають можливість маніпулювати біологічними молекулами, досліджувати і змінювати їхню структуру. За рахунок змін в основних біологічних молекулах ДНК є можливість створювати варіанти живих систем, які не виникають в результаті природної еволюції.
  Технології одержання рекомбінантних молекул ДНК і клонування (розмноження) генів передавали методи, за допомогою яких молекулу ДНК розщеплюють на фрагменти, модифікують і знову реконструюють в одне ціле. При цьому мають багато копій цієї молекули. Потім, використовуючи цю рекомбінантну молекулу, можна синтезувати молекули РНК і одержати білок з певними якостями і властивостями.
  Слід зазначити, що чіткої різниці між молекулярною біологією і генною інженерією немає. Пояснюється це тим, що біотехнологія (в даному випадку генна інженерія) використовує методи, розроблені молекулярною біологією.
  Вивчення загальних біохімічних властивостей клітинної ДНК не давало можливості визначити особливості її генетичної структури. Вирішенню цього питання сприяли два методи молекулярної біології. Перший метод — відкриття гідролітичних ферментів (рестриктаз рестрикційних ендонуклеаз), які в певних місцях розщеплюють ДНК на фрагменти, що мають специфічну нуклеотидну послідовність молекули ДНК. Рестриктази одержують з бактеріальних клітин.
  Ферменти рестриктаз гідролізують нуклеотидні послідовності, в результаті чого мають фрагменти ДНК. їх може бути від кількох сотень до кількох тисяч і більше пар, вони розрізняються за молекулярною масою. Фрагменти виділяють в ізольованому вигляді за допомогою електрофорезу в гелі, а потім аналізують.
  Другим методичним прийомом є визначення нуклеотидної послідовності фрагментів ДНК, які одержують за допомогою рестриктаз у макромолекулі ДНК.
  Близько 50 років тому було експериментально встановлено, що молекула ДНК є носієм спадковості. Вивчення спадковості на молекулярному рівні дало можливість з'ясувати, що в ДНК запрограмована «інструкція» щодо синтезу необхідних білків організму.
  Пізніше було виявлено, що «інструкція» записана відповідно до послідовності розміщення нуклеотидів у ДНК і згідно з цим записом синтезується білок речовин, які беруть участь у синтезі. 
  При визначенні послідовності нуклеотидів або повному прочитуванні генетичної інформації в ДНК було багато проблем. Для невеликої молекули — транспортної РНК (тРНК), завданням якої є транспортувати частини білків — амінокислоти до місця збирання білка, проблема нуклеотидної послідовності була вирішена ще в 1965 р. групою американських вчених. Вони опрацювали принципи і методи, за допомогою яких можна визначити послідовність розміщення нуклеотидів у тРНК.
  Молекули ДНК містять багато нуклеотидів. Навіть маленькі молекули включають їх понад 5000. Так, в одній з найменших вірусній ДНК фагу ФХ174 є 5375 нуклеотидів. В тРНК їх приблизно 80. У 1975 р. була опублікована стаття англійських вчених Ф. Сенгера і А. Коулсона, де йшлося про новий метод аналізу ДНК. Після цієї статті менш ніж через два роки були опубліковані результати визначення повної послідовності нуклеотидів ДНК фагу ФХ174.
  Послідовність розміщення нуклеотидів у ДНК позначають початковою буквою назви нуклеотиду: аденін — А, цитозин — Ц, гуанін — Г, тимідин — Т. Так, навіть для запису послідовності нуклеотидів маленької ДНК фагу ФХ174, яка має 5375 нуклеотидів, потрібно близько трьох сторінок машинопису.
  Пари азотистих основ формують різні інформаційні блоки, кількість яких у геномі (сукупності всіх генів хромосоми організму) становить 50—100 тис.
  Одночасно з визначенням послідовності розміщення нуклеотидів у молекулі ДНК на прикладі вірусів були визначені ділянки, які не входять до структури гена, не кодують білки, але беруть участь у регуляції експресії генів і самовідтворенні (реплікації) вірусної ДНК.
  У молекулярній біології розроблено методи виділення генів донорських організмів, уведення їх у векторну молекулу і одержання гібридних (рекомбінантних) ДНК, забезпечення їхнього самовідтворення (реплікації), переносу в організм реципієнта (клітину-господаря) і забезпечення відчутності дії (експресії) чужих генів.
  Для перенесення генів, яких немає в клітині-реципієнті, використовують переносники (вектори) генів — плазміди (епісоми) — невеликі кільцеві молекули ДНК, здатні до стабільного, не пов'язаного з хромосомами існування і реплікації. Плазміди можуть також бути в геномі клітини-господаря, в хромосомі. Вони є в цитоплазмі бактеріальних клітин деяких дріжджів. Автономне існування їх зумовлене тим, що їхнє розмноження не залежить від розмноження хромосом. Розмір їх різний, і тому розмір генетичної інформації в них теж неоднаковий. За рахунок реплікації кількість копій плазмід регулярно збільшується і вони рівномірно розподіляються між потомством клітини, яка ділиться.
  Рекомбінантні молекули ДНК використовуються і будуть використовуватися в роботі з мікроорганізмами для виробництва різних цінних речовин у медицині, біохімічній промисловості, сільському господарстві. Зокрема добутки генної інженерії використанні для створення нових типів вакцин — рекомбінантних і ДНК-вакцин, а також лікування генетичних дефектів, які раніше не можливо було виправити. Велике значення при цьому має метод клонування генів.
  Технологія конструювання рекомбінантних ДНК є одним з найважливіших досягнень біотехнології. Стосовно рослинництва вона має велике майбутнє у створенні сортів і гібридів з корисними біологічними та екологічними властивостями. Це — високі врожайність і якість врожаю, стійкість проти хвороб, шкідників, бур'янів, здатність до активної азотфіксації, одночасність дозрівання, посухостійкість, високий коефіцієнт засвоєння ФАР (висока продуктивність) та ін.
  На сьогоднішній день генетична інженерія сільськогосподарських рослин розвивається переважно в руслі класичної селекції. Основні зусилля вчених зосереджені на захисті рослин від несприятливих (біотичних та абіотичних) факторів, покращенні якості та зменшенні втрат при зберіганні продукції рослинництва. Зокрема, це підвищення стійкості проти хвороб, шкідників, заморозків, солонцюватості ґрунту тощо, видалення небажаних компонентів із рослинних олій, зміна властивостей білка і крохмалю в пшеничному борошні, покращення лежкості та смакових якостей овочів та ін. Порівняно з традиційною селекцією, основними інструментами якої є схрещування і відбір, генна інженерія дає можливість використання принципово нових генів, які визначають агрономічно важливі ознаки, і нових молекулярно-генетичних методів моніторингу трансгенів (молекулярні маркери генів), що в багато разів прискорюють процес створення трансгенних рослин. Селекціонерів приваблює можливість цілеспрямованого генетичного «ремонту» рослин. Важливим напрямом є створення генетично модифікованих рослин (ГМР) з ознакою чоловічої стерильності. Крім того, завдяки генетичній модифікації рослини можуть виконувати не властиву їм раніше функцію. Прикладом є коренеплоди цукрових буряків, які накопичують замість сахарози низькомолекулярні фруктами, банани, які використовують як їстівну вакцину. Завдяки введенню генів бактерій вищі рослини набувають властивості руйнувати чужорідні органічні сполуки (ксенобіотики), що забруднюють довкілля. Вирощування ГМР, стійких до широкого спектра хвороб та комах-шкідників, може суттєво знизити, а в подальшому звести до мінімуму пестицидне навантаження на довкілля.
  `

export const thirdText = `
  JavaScript – мова програмування, на якій сьогодні працює все – від веб-додатків до мобільних додатків і серверів. Підтримує об’єктно-орієнтований, імперативний і функціональний стилі. Є реалізацією мови ECMAScript (стандарт ECMA-262. ЇЇ популярність різко зросла за останні кілька років, обійшовши такі мови, як Java і PHP. Назва «JavaScript» є зареєстрованим товарним знаком компанії Oracle Corporation у США.
  JavaScript зазвичай використовується як вбудований мова для програмного доступу до об’єктів додатків. Найбільш широке застосування знаходить в браузерах як мова сценаріїв для додання інтерактивності веб-сторінок.
  Сьогодні кожен браузер підтримує його, тим самим роблячи JavaScript мовою інтернету.
  На JavaScript зробили вплив багато мов, при розробці була мета зробити мову схожим на Java, але при цьому легким для використання непрограмістами. Мовою JavaScript не володіє якась компанія або організація, що відрізняє його від ряду мов програмування, що використовуються в веб-розробки.
  JavaScript – це нативна мова, база, а бібліотеки і фреймворки – все те, що вже “накладається” зверху. Мова програмування “ДжаваСкріпт” клієнтська і виконується на стороні браузера. Грубо кажучи, все навантаження лягає саме на ПК користувача, а не на сервер, як було б у випадку з PHP. Тому кривий скрипт також буде безпосередньо зачіпати клієнта, а не сервер: добре для вас, але погано для користувача.
  jQuery – додаткова бібліотека, здатна полегшити роботу з XHR-запитами і селекторами.
  Node.js являє собою серверну варіацію JS.
  Gulp – автоматизація робіт (наприклад по складанню проекту).
  Webpack замінює собою і Gulp, і багато інших інструментів. Це складальник модулів, який дозволяє зібрати всі js-файли у необхідну кількість пакетів, а також переконатися в правильності порядку зібраних файлів.
  Angular/Vue/React – виберіть один інструмент з трьох перерахованих. Решта – по мірі необхідності.
  Ідеальної послідовності не існує. Все залежить від того, чим ви займаєтеся і на що орієнтовані: фронтенд або full-stack. Вивчати JavaScript ви можете і склавши свій план.
  Для початку перейдіть на будь-який каталог плагінів для JavaScript або jQuery. Знаходьте цікавий, не дуже складний плагін (наприклад карусель, лайтбокс, слайдер і т.п.) і намагаєтеся зробити схожий, тільки краще. Спочатку буде важко, але це буде вже реальне завдання, де ви почнете стикатися з особливостями мови. Ось тут знання і почнуть отримувати якусь структуру у вас в голові.
  Якщо ви плануєте майбутнє як фронтенд-фахівець, і хочете писати код для браузерів, то рекомендую почати з вивчення jQuery-фреймворка. Він допоможе уникнути зайвих на даний момент проблем з кросбраузерністю. Наявність jQuery зовсім не скасовує знання JS, там все ті ж змінні, об’єкти, масиви, функції, цикли, умови і т.д.
  Не намагайтеся брати відразу складні речі, починайте з малого. Спочатку не беріть до уваги занадто складні книжки та системи самонавчання, до них можна перейти згодом, добре засвоївши основи.
  Коли люди намагаються вивчити JavaScript або яке-небудь інше вміння, вони часто стикаються з одними і тими ж проблемами.
  Не дозволяйте майбутнім рішенням зупиняти вас від розвитку зараз
  Багато початківці вивчати JavaScript задаються питанням, який фреймворк почати використовувати. Але, якщо ви ще погано знаєте чистий JavaScript, то це неправильно ставити таке питання. Ви будете витрачати весь свій час на пошуки різних фреймворків, а не рухатися вперед у своєму розвитку.
  Одна з найчастіших проблем, яка є у людей, це те, що вони не можуть знайти час для програмування, але ті ж люди дуже часто проводять час на таких сайтах, як Facebook, YouTube, Wikipedia або Reddit. Не важливо, стосується це вам чи ні, ви все одно знайдете, чого тут повчитися.
  У мене дійсно був час, коли я тільки й хотів, що сидіти в Facebook, але я не проводив там годинник. Як так вийшло? А сталося це тому, що я і не збирався залишатися там довго. Почати працювати над чимось – це найважча частина, тому, зберігаючи первісне зобов’язання, мені здається це зробити простіше. Якби хтось запитав мене, я готовий проводити години в Facebook, я б відповів немає, тому що у мене немає часу на це. Мені більше подобається заходити туди, щоб щось перевірити по-швидкому, і тільки.
  Хороші новини в тому, що ви можете використовувати цей метод при вивченні програмування. Не беріть на себе зобов’язання провести кілька годин за написанням коду, тому що тоді у вас ніколи не буде на це часу. Просто скажіть собі, що ви збираєтеся спробувати якийсь код протягом трьох хвилин і ви більше ніколи не будете шукати час на практику.
  Це суперечить здоровому глузду, тому я поясню це історією.
  Мій друг одного разу був збентежений з приводу однієї особливості JavaScript. Я попросив його розповісти мені, що він знає, а потім пояснити, яка частина з цього йому не зрозуміла. Як тільки він пішов з кодом, я зрозумів, що він квапиться.
  “Почекай!” – сказав я йому. “Не квапся і розкажи мені кожен крок цього коду”.
  Мій друг продовжив говорити мені про коді загалом.
  Я знову його зупинив. “Ти все ще поспішаєш. Спробуй знову, але на цей раз пройдися по кожному рядку коду і розкажи мені, що тут відбувається”.
  На цей раз мій друг розповів про коді набагато краще. Суть в тому, що він знайшов час на те, щоб розглянути і зрозуміти кожну строчку коду, замість того, щоб намагатися зрозуміти, що тут відбувається, негайно.
  Якщо шматок коду здається складним або незнайомим, напишіть його спочатку на простому мовою. Таким чином, ви зможете з’ясувати, що ви хочете, щоб код робив перед тим, як ви його напишіть. Ось дві переваги такого підходу:
  Ваш код буде легше і швидше написати, тому що вам не доведеться періодично зупинятися, щоб обміркувати, як ви хочете, щоб він себе вів
  Ви знайдете помилки перед тим, як вони відбудуться, тому що у вас буде чітке уявлення, що слід робити кодом
`